cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "libtool"
brew "cask"
brew "composer"
brew "ffmpeg"
brew "gcc"
brew "git"
brew "libxml2"
brew "mas"
brew "node"
brew "php", restart_service: true
brew "php-code-sniffer", link: false
brew "php-cs-fixer"
brew "phpunit", link: false
brew "subversion"
brew "tree"
brew "wget"
brew "wp-cli"
brew "youtube-dl"
brew "zlib"

cask "aerial"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "bbedit"
cask "carbon-copy-cloner"
#cask "citrix-workspace"
cask "docker"
cask "encryptme"
cask "firefox"
cask "gitkraken"
cask "google-chrome"
cask "handbrake"
cask "horos"
cask "imageoptim"
cask "imazing"
cask "keybase"
cask "maccy"
cask "netnewswire"
cask "openinterminal"
cask "openinterminal-lite"
cask "openineditor-lite"
cask "plex-media-server"
cask "quickbooks"
cask "screens"
cask "sequel-pro-nightly"
cask "slack"
cask "spamsieve"
cask "suspicious-package"
cask "tableplus"
cask "transmit"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vlc"
cask "wordpresscom"
cask "zoom"
#cask "https://www.corecode.io/macupdater/casks/citrix-workspace.rb"

mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Apple Configurator 2", id: 1037126344
mas "GarageBand", id: 682658836
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "iPreview", id: 1519213509
mas "Keynote", id: 409183694
mas "MsgFiler", id: 418778021
mas "NeoOffice", id: 639210716
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Patterns", id: 429449079
mas "PDFOptim", id: 621276561
mas "Pixelmator Pro", id: 1289583905
mas "PreviewMarkdown", id: 1492280469
mas "RAW Power", id: 1157116444
mas "SnapNDrag Pro", id: 430397512
mas "Trello", id: 1278508951
mas "Tweetbot", id: 1384080005
mas "Whalebird", id: 1378283354
mas "Xcode", id: 497799835
mas "XDebugToggle", id: 1437227804
