cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "libtool"
brew "cask"
brew "composer"
brew "ffmpeg"
brew "gcc"
brew "git"
brew "gh"
brew "libxml2"
brew "mas"
brew "node"
brew "nvm"
brew "php", restart_service: true
brew "php-code-sniffer", link: false
brew "php-cs-fixer"
brew "phpunit", link: false
brew "subversion"
brew "tree"
brew "wget"
brew "wp-cli"
brew "zlib"

cask "1password"
cask "aerial"
cask "appcleaner"
cask "bbedit"
cask "carbon-copy-cloner"
cask "citrix-workspace"
cask "docker"
#cask "encryptme"
cask "element"
#cask "firefox"
cask "gitkraken"
cask "google-chrome"
cask "handbrake"
cask "horos"
cask "ice"
cask "imageoptim"
cask "imazing"
cask "jordanbaird-ice"
cask "keybase"
cask "local"
cask "local@beta"
#cask "maccy"
cask "netnewswire"
cask "openinterminal"
cask "openinterminal-lite"
cask "openineditor-lite"
cask "plex-media-server"
cask "slack"
#cask "spamsieve"
cask "suspicious-package"
#cask "tableplus"
cask "transmit"
cask "visual-studio-code"
#cask "visual-studio-code-insiders"
cask "vlc"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Darkroom", id: 953286746
#mas "GarageBand", id: 682658836
mas "Hyperspace", id: 6739505345
mas "iA Writer", id: 775737590
#mas "iMovie", id: 408981434
mas "iPreview", id: 1519213509
mas "Ivory", id: 6444602274
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "MsgFiler 4", id: 6478043112
mas "NeoOffice", id: 639210716
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pastebot", id: 1179623856
mas "Patterns", id: 429449079
mas "PDFOptim", id: 621276561
mas "Pixelmator Pro", id: 1289583905
mas "Photomator", id: 1444636541
mas "PreviewMarkdown", id: 1492280469
mas "RAW Power", id: 1157116444
mas "SnapNDrag Pro", id: 430397512
mas "TestFlight", id: 899247664
#mas "Trello", id: 1278508951
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
mas "XDebugToggle", id: 1437227804
